import streamlit as st
import pandas as pd
st.set_page_config(layout="centered")


st.title("🍄독버섯이 말아준다")
st.subheader("🍹독버섯이 데이터로 말아주는 생리용품 가이드🍸")


st.warning("해당 데이터는 2023년 12월 20일 기준으로 수집한 데이터입니다")
st.warning("올리브영의 '패드형 생리대' 범주에서 인기순 top 20 제품과 '탐폰 & 생리컵' 범주에서의 \
        모든 제품의 리뷰 데이터를 분석한 자료임을 참고해주세요")

st.markdown("#### ❓ WHAT IS 독버섯?")
st.markdown(" 독버섯은 데이터분석 학습 과정을 통해 만나 과제를 위해 함께 하게 된 프로젝트성 팀입니다.")

st.markdown("#### ❓ WHY 생리용품 가이드북?")
st.markdown("여러분은 매달 생리대를 어떤 기준으로 구매하시나요?")
st.markdown(" 여성이라면 누구나 ‘생리’를 하게 되는데, \
        생리용품에 대한 선택의 폭이 너무 좁았던 불과 얼마 전과 달리 \
        현재는 세상에 너무나 많은 생리용품이 존재합니다. 그 중에 나에게 \
        가장 잘 맞는 제품, 다양한 상황 별로 적합한 제품을 찾기는 하늘의 별을 따는게 쉬울만큼 어렵습니다.\
        그래서 이런 고민을 한 번이라도 해본 사람들(필자 포함)을 위해 올리브영 생리용품 리뷰 \
        데이터 분석한 결과를 토대로 생리용품 가이드북을 제작해보는 프로젝트를 진행하게 되었다. \
        누군가에게는 처음인 생리 또는 도전이 될 수 있는 생리용품을 선택할 때 작은 도움이 되었으면 합니다.")




